Repository: Kwaadpepper/devtoolbox
Catalog: po/*.po
Languages: fr

source: Dev tools at your fingertips
fr: Outils de Devs à portée de main

source: JSON;YAML;YML;Converter;CRON;Parser;GZip;Compressor;Decompressor;Hash;Regex;Markdown;Image;
fr: JSON;YAML;YML;Convertion;CRON;Parseur;GZip;Compresseur;Décompresseur;Hash;Regex;Markdown;Image;

source: If you're tired of endlessly looking online for the right tool, or to find again that website of which you don't recall the name just for a quick conversion, this is the right app for you.
fr: Si vous êtes fatigué de chercher sans cesse en ligne le bon outil ou de retrouver ce site Web dont vous ne vous souvenez pas du nom juste pour une conversion rapide, c'est la bonne application pour vous.

source: This is a collection of powerful yet simple-to-use tools to solve the most common daily development problems.
fr: Il s'agit d'une collection d'outils puissants mais simples à utiliser pour résoudre les problèmes de développement quotidiens les plus courants.

source: Includes:
fr: Comprend :

source: JSON to YAML converter and vice-versa
fr: Convertisseur JSON vers YAML et vice-versa

source: CRON expressions parser
fr: Analyseur d'expressions CRON

source: GZip compressor and decompressor
fr: Compresseur et décompresseur GZip

source: Formatters for common programming languages
fr: Formateurs pour les langages de programmation courants

source: Hash generators
fr: Générateurs de hachage

source: Regex tester
fr: Testeur de regex

source: Markdown Previewer
fr: Prévisualisation Markdown

source: Image converters
fr: Convertisseurs d'images

source: Much more...
fr: Beaucoup plus...

source: Converters
fr: Convertisseurs

source: Convert JSON documents to YAML and vice-versa
fr: Convertir des documents JSON en YAML et vice-versa

source: Timestamp
fr: Horodatage

source: Convert UNIX timestamps to and from plain dates
fr: Convertir les horodatages UNIX en dates simples et inversement

source: Number Bases
fr: Nombre Bases

source: Convert numbers between bases
fr: Convertir des nombres entre bases

source: CRON Parser
fr: Analyseur CRON

source: Convert CRON expressions to time and date
fr: Convertir les expressions CRON en heure et date

source: Reverse CRON
fr: Traduire CRON

source: Generate CRON expressions
fr: Générer des expressions CRON

source: Encoders & Decoders
fr: Encodeurs et Décodeurs

source: Encode and decode special characters using the HTML format
fr: Encoder et décoder les caractères spéciaux en utilisant le format HTML

source: Encode and decode base64 strings
fr: Encoder et décoder les caractères en base64

source: Encode and decode special characters inside URLs
fr: Encoder et décoder les caractères spéciaux dans les URL

source: Compress and decompress files and texts using GZip
fr: Compresser et décompresser des fichiers et des textes à l'aide de GZip

source: Decode JWT tokens to header and payload
fr: Décoder les jetons JWT en en-tête et charge utile

source: Formatters & Minifiers
fr: Formateurs et minimiseurs

source: Format JSON documents
fr: Formatage des documents JSON

source: Format SQL documents
fr: Formatage des documents SQL

source: Format XML documents
fr: Formatage des documents XML

source: Format HTML documents
fr: Formater des documents HTML

source: Format JavaScript documents
fr: Formatage des documents JavaScript

source: Format CSS documents
fr: Formatage des documents CSS

source: Minify CSS documents
fr: Simplifier des documents CSS

source: Minify JavaScript documents
fr: Simplifier du code JavaScript

source: Generators
fr: Générateurs

source: Calculate MD5, SHA1, SHA256, and SHA512 hashes and check for integrity
fr: Calculer les hachages MD5, SHA1, SHA256 et SHA512 et en vérifier l'intégrité

source: Generate lorem ipsum placeholder text
fr: Générer un texte de remplacement lorem ipsum

source: Generate Universally Unique IDs (UUID)
fr: Générer des identifiants universels uniques (UUID)

source: Random
fr: Aléatoire

source: Generate random numbers and strings
fr: Générer des nombres et des chaînes de caractères aléatoires

source: Chmod Calculator
fr: Calculatrice Chmod

source: Calculate values to modify permissions with chmod
fr: Calculer les valeurs pour modifier les permissions avec chmod

source: Create custom QR Codes
fr: Créer des QR Codes

source: Text Inspector & Case Converter
fr: Texte et convertisseur de casse

source: Text
fr: Texte

source: View statistics about text and change sentence cases
fr: Afficher des statistiques sur le texte et modifier les cas de figure

source: Regex Tester
fr: Testeur Regex

source: Find matching strings inside a text
fr: Recherche de chaînes de caractères correspondantes dans un texte

source: Text Diff
fr: Différence de texte

source: Analyze two texts and find differences
fr: Analyser deux textes et trouver les différences

source: XML Scheme Validator
fr: Validateur de schéma XML

source: Check an XML file against an XSD schema
fr: Vérifier un fichier XML à partir d'un schéma XSD

source: JSON Schema Validator
fr: Validateur de schéma JSON

source: Check a JSON file against a JSON schema
fr: Vérifier la conformité d'un fichier JSON par rapport au standard

source: Preview markdown code as you type
fr: Prévisualiser le code markdown lors de l'écriture

source: Contrast Checker
fr: Vérificateur de constraste

source: Graphics
fr: Graphiques

source: Check a color combination for WCAG compliance
fr: Vérifier la conformité d'une combinaison de couleurs avec les WCAG

source: Color Blindness
fr: Daltonisme

source: Simulate color blindness in images
fr: Simuler le daltonisme sur des images

source: Image Format Converter
fr: Convertisseur de format d'image

source: Convert images to different formats
fr: Convertir des images en différents formats

source: Certificate Parser
fr: Analyseur de certificat

source: Certificates
fr: Certificats

source: View certificates contents
fr: Voir le contenu des certificats

source: Certificate Signing Request
fr: Demande de signature de certificat

source: Generate certificate signing requests
fr: Générer des demandes de signature de certificat

source: Opening file...
fr: Ouverture du fichier...

source: Cannot open more than one file
fr: Impossible d'ouvrir plus d'un fichier

source: Opening image...
fr: Ouverture de l'image...

source: Open File
fr: Ouvrir un fichier

source: Open
fr: Ouvrir

source: Supported Image Formats
fr: Formats d'images pris en charge

source: Saving image...
fr: Sauvegarde de l'image...

source: Save file as
fr: Enregistrer sous

source: Save
fr: Enregistrer

source: Text files
fr: Fichiers de texte

source: Accepted files
fr: Fichiers acceptés

source: Loading a large file ({size}) Might take a while, please wait...
fr: Chargement d'un gros fichier ({size}) Cela peut prendre du temps, merci de patienter...

source: Unable to open {file_path}: {file_content}.
fr: Impossible d'ouvrir {file_path} : {file_content}.

source: File is not UTF-8 encoded.
fr: Le fichier n'est pas encodé en UTF-8.

source: All files
fr: Tous les fichiers

source: Text files and images
fr: Fichiers texte et images

source: Saving file...
fr: Sauvegarde du fichier…

source: Unable to save {path}
fr: Sauvegarde impossible : {path}

source: Error: {error}
fr: Erreur : {error}

source: Unsupported file
fr: Fichier non pris en charge

source: Expand All
fr: Tout développer

source: Collapse All
fr: Tout réduire

source: Error: Cannot open this file because it is not a valid certificate.
fr: Erreur : Impossible d'ouvrir ce fichier car il ne s'agit pas d'un certificat valide.

source: Identity: {identity}
fr: Identité : {identity}

source: Verified by: {verified_by}
fr: Vérifié par : {verified_by}

source: Expires: {expiration_date}
fr: Expire le : {expiration_date}

source: Basic Constraints
fr: Contraintes de base

source: Extended Key Usage
fr: Utilisation étendue des clés

source: Subject Key Identifier
fr: Chercheur de Subject Key

source: Key Usage
fr: Utilisation de la clef

source: Subject Alternative Names
fr: Noms alternatifs du sujet

source: Certificate Fingerprints
fr: Empreintes du certificat

source: Key Identifier
fr: Identifiant de la clé

source: Open CSR
fr: Ouvrir le CSR

source: Open Key File
fr: Ouvrir le fichier de clés

source: All Files
fr: Tous les fichiers

source: Select save location
fr: Sélectionner l'emplacement de sauvegarde

source: Choose
fr: Choisir

source: Saved Successfully
fr: Sauvegarde réussie

source: Save key as
fr: Enregistrer la clé sous

source: Invalid value. Please check again
fr: Valeur incorrecte. Veuillez réessayer

source: Open Image
fr: Ouvrir l'image

source: Loading simulation...
fr: Chargement de la simulation…

source: Text is not in the correct format. Check if you misspelled something or if all parentheses are closed.
fr: Le texte n'est pas sous le bon format. Vérifiez si vous avez fait une faute d'orthographe ou si toutes les parenthèses sont fermées.

source: Open image
fr: Ouverture de l'image

source: Cannot decompress from an image or a file
fr: Impossible de décompresser à partir d'une image ou d'un fichier

source: Please save this file to view its contents
fr: Veuillez enregistrer ce fichier pour en visualiser le contenu

source: Hashes match!
fr: Les hashs correspondent !

source: The integrity is verified.
fr: L'intégrité est vérifiée.

source: Warning, integrity cannot be verified!
fr: Attention, l'intégrité ne peut être vérifiée !

source: The calculated hash and the provided one do not match. Check again and if this is a file you downloaded from the Internet re-download it.
fr: Le hash calculé et celui fourni ne correspondent pas. Vérifiez à nouveau et, s'il s'agit d'un fichier que vous avez téléchargé sur l'internet, téléchargez-le à nouveau.

source: Valid!
fr: Valide !

source: JSON is compliant with the provided JSON schema.
fr: Le JSON est conforme au schéma JSON fourni.

source: Invalid!
fr: Invalide !

source: JSON is not compliant with the provided JSON scheme: {validation_error}
fr: JSON n'est pas conforme au schéma JSON fourni : {validation_error}

source: Error in JSON schema: {schema_error}
fr: Erreur dans le schéma JSON : {schema_error}

source: Not Set
fr: Non spécifié

source: st
fr: er

source: nd
fr: ème

source: rd
fr: ème

source: th
fr: ème

source: January
fr: Janvier

source: February
fr: Février

source: March
fr: Mars

source: April
fr: Avril

source: May
fr: Mai

source: June
fr: Juin

source: July
fr: Juillet

source: August
fr: Août

source: September
fr: Septembre

source: October
fr: Octobre

source: November
fr: Novembre

source: December
fr: Décembre

source: Sunday
fr: Dimanche

source: Monday
fr: Lundi

source: Tuesday
fr: Mardi

source: Wednesday
fr: Mercredi

source: Thursday
fr: Jeudi

source: Friday
fr: Vendredi

source: Saturday
fr: Samedi

source: XML is compliant with the provided XSD schema.
fr: Le XML est conforme au schéma XSD fourni.

source: XML is not compliant with the provided XSD scheme: {xsd_error}
fr: Le XML n'est pas conforme au schéma XSD fourni : {xsd_error}

source: Show/hide searchbar
fr: Afficher/cacher la barre de recherche

source: Favorite Tools
fr: Outils Favoris

source: No Favorites
fr: Aucun Favori

source: Add your favorite tools here by clicking the star button beside the title
fr: Ajoutez votre outil favori ici en cliquant sur l'étoile sous le titre

source: Favorites
fr: Favoris

source: Search Tools…
fr: Outils de recherche…

source: Show/hide sidebar
fr: Montrer/cacher la barre latérale

source: _Keyboard Shortcuts
fr: _Raccourcis Claviers

source: _About Dev Toolbox
fr: _A propos de Dev Toolbox

source: Copyright © 2022 - 2024 Alessandro Iepure Some icons are copyright of the GNOME Project
fr: Tous droits réservés 2022-2024 Alessandro lepure Certaines icônes sont sous licence Gnome Project

source: translator-credits
fr: Remerciements aux traducteurs Munsch Jéremy <contact@jeremydev.ovh>

source: Now
fr: Maintenant

source: Sets the current system date and time
fr: Réglez l'heure et la date actuelle

source: Copy to clipboard
fr: Copier dans le presse-papier

source: Year
fr: Année

source: Month
fr: Mois

source: Day
fr: Jour

source: Hours
fr: Heures

source: Seconds
fr: Secondes

source: Generate again
fr: Régénérer

source: Paste clipboard
fr: Coller le contenu du presse-papier

source: Clear input
fr: Effacer l'entrée

source: Open image in another program
fr: Ouvrir l'image dans un autre programme

source: Follow system style
fr: Appliquer le style du bureau

source: Light style
fr: Lumineux

source: Dark style
fr: Sombre

source: Open web page in another browser
fr: Ouvrir la page dans un autre navigateur

source: Number Bases Converter
fr: Convertisseur de base numérique

source: Input numbers
fr: Nombres en entrée

source: Decimal
fr: Décimal

source: Binary
fr: Binaire

source: Hexadecimal
fr: Hexadécimal

source: Typing an unaccepted character (i.e. 'A' in the decimal field) will cause all the fields to reset to 0.
fr: Entrer un caractère invalide (i.e. 'A' dans un champ décimal) entraine la remise à 0 de tous les autres champs.

source: Base64 Encoder & Decoder
fr: Encodeur et décodeur Base64

source: Encode and decode strings using the Base64 format
fr: Encoder et décoder des chaînes de caractères en utilisant le format Base64

source: Tool options
fr: Options de l'outil

source: Select the desired encoding direction
fr: Sélection le sens de codage

source: Encode
fr: Encoder

source: Decode
fr: Décoder

source: URL Safe
fr: Compatible avec une URL

source: Use URL safe Base64 processing
fr: Utiliser un traitement base64 compatible avec une URL

source: Input
fr: Entrée

source: Output
fr: Sortie

source: Certificate
fr: Certificat

source: Open a certificate file (pem, der, cer extensions)
fr: Ouvrir un fichier de certificat (extensions pem, der, cer)

source: Open a certificate file to view its contents.
fr: Ouvrir un fichier de certificat pour voir son contenu.

source: Certificate Signing Request Generator
fr: Générateur de demande de signature de certificat

source: Fill the information below
fr: Entrer les informations ci-dessous

source: Fill at least the required fields then press the 'Create CSR' button. An empty passphrase will generate an unecrypted CSR.
fr: Entrer au moins les champs obligatoires puis cliquer sur le bouton 'Créer le CSR'. Une phrase secrète vide générera un CSR non chiffré.

source: Create CSR
fr: Créer le CSR

source: Common Name (CN) *
fr: Nom Commun (CN) *

source: Country Name (C)
fr: Pays (C)

source: State or Province Name (ST)
fr: État ou province (ST)

source: Locality Name (L)
fr: Localité (L)

source: Organization Name (O)
fr: Organisation (O)

source: Organization Unit Name (OU)
fr: Unité organisationnelle (OU)

source: Passphrase
fr: Phrase secrète

source: Key
fr: Clé

source: Generate a new key or use and existing one
fr: Générer un nouvelle clé ou utiliser une clé existante

source: New
fr: Nouveau

source: Existing
fr: Existant

source: Key File *
fr: Fichier de clé *

source: Open the file containing the key you want to use
fr: Ouvrir le fichier contenant la clé que vous voulez utiliser

source: Key Size
fr: Taille de la clé

source: Size of the new key. It will be saved on the same path as the CSR.
fr: Taille de la nouvelle clé. Elle sera sauvegardée au même endroit que la CSR.

source: Key Save Location *
fr: Emplacement de la sauvegarde de la clé *

source: Save location for the generated key file
fr: Emplacement de sauvegarde du fichier de clé généré

source: Owner
fr: Propriétaire

source: Group
fr: Groupe

source: Others
fr: Autres

source: Read
fr: Lire

source: Write
fr: Écrire

source: Execute
fr: Exécuter

source: Numeric value
fr: Valeur numérique

source: Symbolic value
fr: Valeur symbolique

source: Color Blindness Simulator
fr: Simulateur de daltonisme

source: Severity
fr: Sévérité

source: Severity of the anomaly
fr: Gravité de l'anomalie

source: Protanopia
fr: Protanopie

source: Deuteranopia
fr: Deutéranopie

source: Tritanopia
fr: Tritanopie

source: Text color
fr: Couleur du texte

source: Color used for the text
fr: Couleur utilisée pour le texte

source: Background color
fr: Couleur de fond

source: Color used for the background
fr: Couleur utilisée pour le fond

source: Example
fr: Exemple

source: small
fr: petit

source: large
fr: grand

source: Number of dates
fr: Nombre de dates

source: Number of dates to be generated (up to 20)
fr: Nombre de dates à générer (jusqu'à 20)

source: Output format
fr: Format de sortie

source: Format used to display generated dates (<a href="https://strftime.org/">python syntax</a>)
fr: Format utilisé pour afficher les dates générées (<a href="https://strftime.org/">syntaxe python</a>)

source: CRON expression
fr: Expression CRON

source: Number of spaces used for indentation
fr: Nombre d'espaces dans l'indentation

source: GZip Compress & Decompress
fr: Compression & décompression GZip

source: Compress and decompress texts and images using GZip
fr: Compresser et décompresser des fichiers texte et image avec GZip

source: Select the desired operation
fr: Sélectionner l'opération souhaitée

source: Compress
fr: Compresser

source: Decompress
fr: Décompresser

source: The compression result and the expected decompression input are base64 encoded.
fr: Le résultat de la compression et l'entrée de décompression attendue sont chiffrés en base64.

source: May hang the app for large files, please wait.
fr: Cela peut prendre un certain temps pour les fichiers volumineux. Patientez s'il vous plait.

source: Hash Generator & Checker
fr: Générateur de hachage & vérificateur

source: Hash to calculate
fr: Hachage à calculer

source: Choose the hash type to calculate
fr: Choisir le type de hachage à utiliser

source: Check for integrity
fr: Vérification d'intégrité

source: If enabled the calculated hash will be checked against another provided hash to verify integrity
fr: Si activé le calcul du hachage sera comparé à un autre hachage pour vérifier son intégrité

source: Type the hash to check against
fr: Type de hachage pour la comparaison

source: HTML Encoder & Decoder
fr: Encodeur & décodeur HTML

source: Select the desired output format
fr: Sélectionner le format de sortie

source: Convert
fr: Convertir

source: converted-image
fr: image convertie

source: JSON - YAML Converter
fr: Convertisseur JSON - YAML

source: Specify what format is the input and the desired output
fr: Fournir le format d'entrée et de sortie désiré

source: JWT tokens decoder
fr: Décodeur de jeton JWT

source: Token
fr: Jeton

source: Header
fr: Entête

source: Payload
fr: Données

source: Lorem Ipsum Generator
fr: Générateur Lorem Ipsum

source: Begin with "Lorem ipsum dolor sit amet"
fr: Commencer avec "Lorem ipsum dolor sit amet"

source: Amount
fr: Quantité

source: Words
fr: Mots

source: Sentences
fr: Phrases

source: Paragraphs
fr: Paragraphes

source: Generated text
fr: Texte généré

source: Preview
fr: Aperçu

source: QR Code Generator
fr: Générateur de QR code

source: Tool Options
fr: Options de l'outil

source: Fill the required information and press 'generate'
fr: Compléter les champs obligatoires et cliquer sur 'générer'

source: Content type
fr: Type de contenu

source: Choose the content of the QR Code
fr: Choisir le contenu du QR code

source: Text/URL
fr: Texte/URL

source: WiFi Network
fr: Réseau WIFI

source: Network Name (SSID)
fr: Nom du Réseau (SSID)

source: Network Encryption
fr: Chiffrement du réseau

source: None
fr: Aucun

source: Network Password
fr: Mot de passe du réseau

source: First Name *
fr: Prénom *

source: Last Name *
fr: Nom *

source: Phone Number
fr: Numéro de téléphone

source: Birthday
fr: Anniversaire

source: Select from calendar:
fr: Sélectionner dans le calendrier :

source: Address
fr: Addresse

source: Street
fr: Rue

source: City
fr: Ville

source: State
fr: État

source: ZIP Code
fr: Code postal

source: Country
fr: Pays

source: Generated QR Code
fr: Code QR généré

source: Generate
fr: Générer

source: Random Generator
fr: Générateur aléatoire

source: String
fr: Chaîne de caractères

source: Generate a random string with the given options. ASCII characters only.
fr: Génère une chaîne aléatoire avec les paramètres donnés. Caractères ASCII uniquement.

source: Length
fr: Longueur

source: Length of the generated string
fr: Longueur de la chaîne de caractères générée

source: Uppercase letters (A-Z)
fr: Lettres majuscules (A-Z)

source: Lowercase letters (a-z)
fr: Lettres minuscules (a-z)

source: Numbers (0-9)
fr: Chiffres (0-9)

source: Special characters (!"#$%&amp;'()*+,-./:;&lt;=&gt;?@[\]^_`{|}~)
fr: Caractères spéciaux ( !"#$%&amp;'()*+,-./:;&lt;=&gt;?@[\]^_`{|}~)

source: Generated string
fr: Chaîne de caractères générée

source: Number
fr: Nombre

source: Generate a random number in the given range
fr: Générer un nombre aléatoire dans l'intervalle donné

source: Minimum value of the generated number
fr: Valeur minimale du nombre généré

source: Maximum value of the generated number
fr: Valeur maximale du nombre généré

source: Generated number
fr: Nombre généré

source: Regular Expression Tester
fr: Testeur d'expressions régulières

source: Regex to test
fr: Expression régulière à tester

source: Every minute
fr: Chaque minute

source: Every
fr: Chaque

source: minute(s) starting at minute
fr: minute(s) à partir de la minute

source: Specific minute (choose one or many, no selection means every minute)
fr: Minute spécifique (en choisir une ou plusieurs, l'absence de sélection signifie toutes les minutes)

source: Every minute between minute
fr: Chaque minute entre la minute

source: and minute
fr: et la minute

source: Every hour
fr: Chaque heure

source: hour(s) starting at hour
fr: heure(s) à partir de l'heure

source: Specific hour (choose one or many, no selection means every hour)
fr: Heure spécifique (choisir une ou plusieurs heures, l'absence de sélection signifie toutes les heures)

source: Every hour between hour
fr: Chaque heure entre l'heure

source: and hour
fr: et l'heure

source: Every day
fr: Tous les jours

source: day(s) starting on the
fr: jour(s) à partir du

source: of the month
fr: du mois

source: Specific day of month (choose one or many, no selection means every day)
fr: Jour spécifique du mois (choisir un ou plusieurs, l'absence de sélection signifie tous les jours)

source: Every day between the
fr: Chaque jour à partir du

source: and the
fr: jusqu'au

source: Every month
fr: Chaque mois

source: month(s) starting in
fr: mois à partir de

source: Specific month (choose one or many, no selection means every month)
fr: Mois spécifique (en choisir un ou plusieurs, l'absence de sélection signifie tous les mois)

source: Every month between
fr: Chaque mois à partir de

source: and
fr: jusqu'à

source: Weekday
fr: Jour de la semaine

source: Every weekday
fr: Tous les jours de la semaine

source: weekday(s) starting on
fr: jours de la semaine à partir de

source: Specific weekday (choose one or many, no selection means every weekday)
fr: Jour de semaine spécifique (choisir un ou plusieurs, l'absence de sélection signifie tous les jours de la semaine)

source: Every weekday between
fr: Chaque jour de la semaine entre

source: Command to execute
fr: Commande à exécuter

source: CRON Expression
fr: Expression CRON

source: Old Text
fr: Ancien texte

source: New Text
fr: Nouveau texte

source: Differences
fr: Différences

source: Change case
fr: Changer la casse

source: Choose a case to apply to the text
fr: Choisir une casse à appliquer au texte

source: Sentence case
fr: Sensible à la casse

source: lower case
fr: minuscule

source: UPPERCASE
fr: MAJUSCULE

source: Cursor
fr: Curseur

source: Line:
fr: Ligne:

source: Column:
fr: Colonne:

source: Characters:
fr: Caractères:

source: Words:
fr: Mots:

source: Lines:
fr: Lignes:

source: Timestamp Converter
fr: Convertisseur d'horodatage

source: Sets the current system timestamp
fr: Utilise l'horodatage du système
