Repository: Kwaadpepper/devtoolbox
Catalog: po/*.po
Languages: fr

source: ISO Date (ISO 8601/RFC 3339)
fr: Date ISO (ISO 8601/RFC 3339)

source: RFC 2822 Date
fr: Date RFC 2822

source: Short Date
fr: Date Courte

source: Short Time
fr: Heure Courte

source: Long Date
fr: Date Longue

source: Long Time
fr: Heure Longue

source: Full Long Date
fr: Date longue complète

source: URL Encoder & Decoder
fr: Encodeur et décodeur d'URL

source: Space encoding
fr: Encodage de l'espace

source: Select the desired encoding for the space character
fr: Sélectionnez l'encodage souhaité pour le caractère espace

source: UUID Generator
fr: Générateur d'UUID

source: Choose the UUID version to generate
fr: Choisissez la version de l'UUID à générer

source: Version 1 (MAC address)
fr: Version 1 (Address MAC)

source: Version 4 (Random)
fr: Version 4 (Aléatoire)

source: Version 6 (Gregorian Time)
fr: Version 6 (Calendrier Gregorien)

source: Version 7 (UNIX Epoch)
fr: Version 7 (époque UNIX)

source: Number of UUIDs to be generated (up to 50)
fr: Nombre d'UUID à générer (jusqu'à 50)

source: Generated UUIDs
fr: UUIDs générés

# shortcut window
source: General
fr: Général

# shortcut window
source: Search Tools
fr: Outils de recherche

# shortcut window
source: Show Shortcuts
fr: Afficher les raccourcis

# shortcut window
source: Quit
fr: Quitter

source: HTML Formatter
fr: Formateur HTML

source: Type HTML code here
fr: Tapez le code HTML ici

# verb/action
source: Format
fr: Formatter

source: JavaScript Formatter
fr: Formateur JavaScript

source: Type JavaScript code here
fr: Tapez le code JavaScript ici

source: JSON Formatter
fr: Formateur JSON

source: Type JSON code here
fr: Tapez le code JSON ici

source: SQL Formatter
fr: Formateur SQL

source: Type SQL code here
fr: Tapez le code SQL ici

source: XML Formatter
fr: Formateur XML

source: Type XML code here
fr: Tapez le code XML ici

source: CSS Formatter
fr: Formateur CSS

source: Type CSS here
fr: Tapez le code CSS ici

source: CSS Minifier
fr: Minifieur CSS

# verb/action
source: Minify
fr: Minifier

source: JavaScript Minifier
fr: Minifieur JavaScript

source: Minify JS code
fr: Minifier le code JS

source: Type JS code here
fr: Tapez le code JS ici
